# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้

#      ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท

#      ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย

#      ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย

#      ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

print("--------------------------------------------------")
emp_id = input("ป้อนรหัสพนักงาน: ")
emp_name = input("ป้อนชื่อพนักงาน: ")
sales = float(input("ป้อนยอดขาย: "))
if sales <= 1000:
    commission = 0.0
elif sales <= 2000:
    commission = sales * 0.01
elif sales <= 3000:
    commission = sales * 0.03
else:
    commission = sales * 0.05
print(f"รหัส: {emp_id} ชื่อ: {emp_name} ยอดขาย: {sales:.2f} บาท")
print(f"ค่าคอมมิชชั่น: {commission:.2f} บาท")

print("--------------------------------------------------")