# โปรแกรมแสดงข้อความต้อนรับนักศึกษา โดยรับชื่อ และชั้นปีทางแป้นพิมพ์แล้วแสดงข้อความต้อนรับ ดังนี้

# 	กรณีป้อนชั้นปี 1 แสดงข้อความ "Welcome Freshman"

# 	กรณีป้อนชั้นปี 2 แสดงข้อความ "Welcome Sophomore"

# 	กรณีป้อนชั้นปี 3 แสดงข้อความ "Welcome Junior"

# 	กรณีป้อนชั้นปี 4 แสดงข้อความ "Welcome Senior"

# 	กรณีป้อน ปีอื่นๆ  แสดงข้อความ "Oh, no ...."
print("--------------------------------------------------")
student_name = input("ป้อนชื่อนักศึกษา: ")
year = input("ป้อนชั้นปี: ")
if year == "1":
    print(f"ยินดีตอนรับน้องๆปี 1, {student_name}")
elif year == "2":
    print(f"สวัวกีน้องๆปี 2, {student_name}")
elif year == "3":
    print(f"สวัวกีน้องๆปี 3, {student_name}")
elif year == "4":
    print(f"สวัวกีน้องๆปี 4, {student_name}")
else:
    print("คุณไม่ใช่นักศึกษา")
print("--------------------------------------------------")